Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J18A.atdf
      <register-group name="DMAC_DESCRIPTOR" caption="Direct Memory Access Controller" section="hsram" aligned="8">
        <register name="BTCTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Block Transfer Control">
          <bitfield name="VALID" caption="Descriptor Valid" mask="0x1"/>
          <bitfield name="EVOSEL" caption="Block Event Output Selection" mask="0x6" values="DMAC_BTCTRL__EVOSEL"/>
          <bitfield name="BLOCKACT" caption="Block Action" mask="0x18" values="DMAC_BTCTRL__BLOCKACT"/>
          <bitfield name="BEATSIZE" caption="Beat Size" mask="0x300" values="DMAC_BTCTRL__BEATSIZE"/>
          <bitfield name="SRCINC" caption="Source Address Increment Enable" mask="0x400"/>
          <bitfield name="DSTINC" caption="Destination Address Increment Enable" mask="0x800"/>
          <bitfield name="STEPSEL" caption="Step Selection" mask="0x1000" values="DMAC_BTCTRL__STEPSEL"/>
          <bitfield name="STEPSIZE" caption="Address Increment Step Size" mask="0xE000" values="DMAC_BTCTRL__STEPSIZE"/>
        </register>
        <register name="BTCNT" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Block Transfer Destination Address">
          <mode name="CRC">
            <bitfield name="CHKINIT" caption="CRC Checksum Initial Value" mask="0xFFFFFFFF"/>
          </mode>
          <mode name="DEFAULT_MODE">
            <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
          </mode>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0"/>
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Block event strobe" value="0x1"/>
        <value name="BURST" caption="Burst event strobe" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 128" value="0x7"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCMODE">
        <value name="DEFAULT" caption="Default operating mode" value="0"/>
        <value name="CRCMON" caption="Memory CRC monitor operating mode" value="2"/>
        <value name="CRCGEN" caption="Memory CRC generation operating mode" value="3"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="DISABLE" caption="CRC Disabled" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
      </value-group>
      <value-group name="DMAC_PRICTRL0__QOS0">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
      <value-group name="DMAC_PRICTRL0__QOS1">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
