Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J18A.atdf
        <register name="SCL" offset="0xE0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Tsu timer second comparison Register">
          <bitfield name="SEC" caption="1588 Timer Second comparison value" mask="0xFFFFFFFF"/>
        </register>
        <register name="SCH" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Tsu timer second comparison Register">
          <bitfield name="SEC" caption="1588 Timer Second comparison value" mask="0xFFFF"/>
        </register>
        <register name="EFTSH" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="EFRSH" offset="0xEC" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="PEFTSH" offset="0xF0" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="PEFRSH" offset="0xF4" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="OTLO" offset="0x100" rw="R" size="4" access-size="4" initval="0x00000000" caption="Octets Transmitted [31:0] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="OTHI" offset="0x104" rw="R" size="4" access-size="4" initval="0x00000000" caption="Octets Transmitted [47:32] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFF"/>
        </register>
        <register name="FT" offset="0x108" rw="R" size="4" access-size="4" initval="0x00000000" caption="Frames Transmitted Register">
          <bitfield name="FTX" caption="Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="BCFT" offset="0x10C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Broadcast Frames Transmitted Register">
          <bitfield name="BFTX" caption="Broadcast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="MFT" offset="0x110" rw="R" size="4" access-size="4" initval="0x00000000" caption="Multicast Frames Transmitted Register">
          <bitfield name="MFTX" caption="Multicast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFT" offset="0x114" rw="R" size="4" access-size="4" initval="0x00000000" caption="Pause Frames Transmitted Register">
          <bitfield name="PFTX" caption="Pause Frames Transmitted Register" mask="0xFFFF"/>
        </register>
        <register name="BFT64" offset="0x118" rw="R" size="4" access-size="4" initval="0x00000000" caption="64 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="64 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT127" offset="0x11C" rw="R" size="4" access-size="4" initval="0x00000000" caption="65 to 127 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="65 to 127 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT255" offset="0x120" rw="R" size="4" access-size="4" initval="0x00000000" caption="128 to 255 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="128 to 255 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT511" offset="0x124" rw="R" size="4" access-size="4" initval="0x00000000" caption="256 to 511 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="256 to 511 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1023" offset="0x128" rw="R" size="4" access-size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="512 to 1023 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1518" offset="0x12C" rw="R" size="4" access-size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="1024 to 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GTBFT1518" offset="0x130" rw="R" size="4" access-size="4" initval="0x00000000" caption="Greater Than 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="Greater than 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TUR" offset="0x134" rw="R" size="4" access-size="4" initval="0x00000000" caption="Transmit Underruns Register">
          <bitfield name="TXUNR" caption="Transmit Underruns" mask="0x3FF"/>
        </register>
        <register name="SCF" offset="0x138" rw="R" size="4" access-size="4" initval="0x00000000" caption="Single Collision Frames Register">
          <bitfield name="SCOL" caption="Single Collision" mask="0x3FFFF"/>
        </register>
        <register name="MCF" offset="0x13C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Multiple Collision Frames Register">
          <bitfield name="MCOL" caption="Multiple Collision" mask="0x3FFFF"/>
        </register>
        <register name="EC" offset="0x140" rw="R" size="4" access-size="4" initval="0x00000000" caption="Excessive Collisions Register">
          <bitfield name="XCOL" caption="Excessive Collisions" mask="0x3FF"/>
        </register>
        <register name="LC" offset="0x144" rw="R" size="4" access-size="4" initval="0x00000000" caption="Late Collisions Register">
          <bitfield name="LCOL" caption="Late Collisions" mask="0x3FF"/>
        </register>
