Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J18A.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="SLEEPRDY" caption="Sleep Mode Entry Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="1" initval="0x00" caption="Standby Configuration">
          <bitfield name="RAMCFG" caption="Ram Configuration" mask="0x3" values="PM_STDBYCFG__RAMCFG"/>
          <bitfield name="FASTWKUP" caption="Fast Wakeup" mask="0x30"/>
        </register>
        <register name="HIBCFG" offset="0x9" rw="RW" size="1" initval="0x00" caption="Hibernate Configuration">
          <bitfield name="RAMCFG" caption="Ram Configuration" mask="0x3"/>
          <bitfield name="BRAMCFG" caption="Backup Ram Configuration" mask="0xC"/>
        </register>
        <register name="BKUPCFG" offset="0xA" rw="RW" size="1" initval="0x00" caption="Backup Configuration">
          <bitfield name="BRAMCFG" caption="Ram Configuration" mask="0x3"/>
        </register>
        <register name="PWSAKDLY" offset="0x12" rw="RW" size="1" initval="0x00" caption="Power Switch Acknowledge Delay">
          <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F"/>
          <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE0" caption="CPU clock is OFF" value="0"/>
        <value name="IDLE1" caption="AHB clock is OFF" value="1"/>
        <value name="IDLE2" caption="APB clock are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="HIBERNATE" caption="Backup domain is ON as well as some PDRAMs" value="5"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="6"/>
        <value name="OFF" caption="All power domains are powered OFF" value="7"/>
      </value-group>
      <value-group name="PM_STDBYCFG__RAMCFG">
        <value name="RET" caption="All the RAMs are retained" value="0"/>
        <value name="PARTIAL" caption="Only the first 32K bytes are retained" value="1"/>
        <value name="OFF" caption="All the RAMs are OFF" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.2.0" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x400000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="PORT Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="PORT Event Action 0" mask="0x60" values="PORT_EVCTRL__EVACT0"/>
          <bitfield name="PORTEI0" caption="PORT Event Input Enable 0" mask="0x80"/>
          <bitfield name="PID1" caption="PORT Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="PORT Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="PORT Event Input Enable 1" mask="0x8000"/>
          <bitfield name="PID2" caption="PORT Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="PORT Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="PORT Event Input Enable 2" mask="0x800000"/>
          <bitfield name="PID3" caption="PORT Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="PORT Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="PORT Event Input Enable 3" mask="0x80000000"/>
        </register>
