Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J18A.atdf
        <register name="INTFLAG" offset="0xC" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="MODE2 Interrupt Flag Status and Clear">
          <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
        </register>
        <register name="DBGCTRL" offset="0xE" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE2 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
          <bitfield name="CLOCK" caption="CLOCK Register Busy" mask="0x8"/>
          <bitfield name="ALARM0" caption="ALARM 0 Register Busy" mask="0x20"/>
          <bitfield name="ALARM1" caption="ALARM 1 Register Busy" mask="0x40"/>
          <bitfield name="MASK0" caption="MASK 0 Register Busy" mask="0x800"/>
          <bitfield name="MASK1" caption="MASK 1 Register Busy" mask="0x1000"/>
          <bitfield name="CLOCKSYNC" caption="Clock Synchronization Enable Bit Busy" mask="0x8000"/>
          <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000"/>
          <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000"/>
          <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000"/>
          <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000"/>
        </register>
        <register name="FREQCORR" offset="0x14" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Frequency Correction">
          <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
          <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
        </register>
        <register name="CLOCK" offset="0x18" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="MODE2 Clock Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="RTC_MODE2_CLOCK__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register-group name="MODE2_ALARM" name-in-module="MODE2_ALARM" offset="0x20" count="2"/>
        <register name="GP" offset="0x40" rw="RW" size="4" count="4" initval="0x00000000" caption="General Purpose">
          <bitfield name="GP" caption="General Purpose" mask="0xFFFFFFFF"/>
        </register>
        <register name="TAMPCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="Tamper Control">
          <bitfield name="IN0ACT" caption="Tamper Input 0 Action" mask="0x3" values="RTC_TAMPCTRL__IN0ACT"/>
          <bitfield name="IN1ACT" caption="Tamper Input 1 Action" mask="0xC" values="RTC_TAMPCTRL__IN1ACT"/>
          <bitfield name="IN2ACT" caption="Tamper Input 2 Action" mask="0x30" values="RTC_TAMPCTRL__IN2ACT"/>
          <bitfield name="IN3ACT" caption="Tamper Input 3 Action" mask="0xC0" values="RTC_TAMPCTRL__IN3ACT"/>
          <bitfield name="IN4ACT" caption="Tamper Input 4 Action" mask="0x300" values="RTC_TAMPCTRL__IN4ACT"/>
          <bitfield name="TAMLVL0" caption="Tamper Level Select 0" mask="0x10000"/>
          <bitfield name="TAMLVL1" caption="Tamper Level Select 1" mask="0x20000"/>
          <bitfield name="TAMLVL2" caption="Tamper Level Select 2" mask="0x40000"/>
          <bitfield name="TAMLVL3" caption="Tamper Level Select 3" mask="0x80000"/>
          <bitfield name="TAMLVL4" caption="Tamper Level Select 4" mask="0x100000"/>
          <bitfield name="DEBNC0" caption="Debouncer Enable 0" mask="0x1000000"/>
          <bitfield name="DEBNC1" caption="Debouncer Enable 1" mask="0x2000000"/>
          <bitfield name="DEBNC2" caption="Debouncer Enable 2" mask="0x4000000"/>
          <bitfield name="DEBNC3" caption="Debouncer Enable 3" mask="0x8000000"/>
          <bitfield name="DEBNC4" caption="Debouncer Enable 4" mask="0x10000000"/>
        </register>
        <register name="TIMESTAMP" offset="0x64" rw="R" access="RSYNC" size="4" initval="0x00000000" caption="MODE2 Timestamp">
          <bitfield name="SECOND" caption="Second Timestamp Value" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute Timestamp Value" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour Timestamp Value" mask="0x1F000" values="RTC_MODE2_TIMESTAMP__HOUR"/>
          <bitfield name="DAY" caption="Day Timestamp Value" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month Timestamp Value" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year Timestamp Value" mask="0xFC000000"/>
        </register>
        <register name="TAMPID" offset="0x68" rw="RW" size="4" initval="0x00000000" caption="Tamper ID">
          <bitfield name="TAMPID0" caption="Tamper Input 0 Detected" mask="0x1"/>
          <bitfield name="TAMPID1" caption="Tamper Input 1 Detected" mask="0x2"/>
          <bitfield name="TAMPID2" caption="Tamper Input 2 Detected" mask="0x4"/>
          <bitfield name="TAMPID3" caption="Tamper Input 3 Detected" mask="0x8"/>
          <bitfield name="TAMPID4" caption="Tamper Input 4 Detected" mask="0x10"/>
          <bitfield name="TAMPEVT" caption="Tamper Event Detected" mask="0x80000000"/>
        </register>
